using Desktop;
using System.Threading;

namespace Tests
{
    [TestClass]
    public class ViewTest
    {
        [TestMethod]
        public void TestMainVindow()
        {
            Thread t = new( () =>
            {
                MainWindow mainWindow = new();
                Assert.IsNotNull(mainWindow, "new MainWindow is not null");
            });
            t.SetApartmentState(ApartmentState.STA);
            t.Start();            
        }
    }
}
/* Тестування (модульне)
 * Модуль - частина програми, яка має функціональність, що її треба перевірити
 * це може бути метод, клас, бібліотека
 * Для тестування створюється окремий проєкт (спец. типу, наприклад, MSTest), 
 * його структура відповідає (класи і методи) прийнято що повторює структуру
 * основного проєкту (із додаванням "тест")
 * Після створення тестового проєкту слід зв'язати його з основним
 *  ПКМ Dependencies -- Add Project Reference  -- [mark] Desktop
 * це робить у тестах видимість класів основного проєкту 
 * За наявності проблем сумісності - переконатись що у тестового проєкту
 *  така ж платформа та операційна система (цільова) - у властивостях проєкту
 *  
 * Щодо управління якістю - є показник "покриття тестами" (tests coverage) 
 * значення у відсотках яка частина коду покрита тестами - бере участь у 
 * тестуванні. Ідеальний випадок - 100 %
 * Реальні показники вважаються нормальними на рівні 70-80%
 * 
 */
